{"format": "graph-model", "generatedBy": "1.14.0", "convertedBy": "TensorFlow.js Converter v1.2.3", "modelTopology": {"node": [{"name": "accuracy_calc/prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "output/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "output/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_2/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_2/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_1/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_1/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer_1/truediv", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer_1/rate", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "layer_1/MatMul", "op": "MatMul", "input": ["X", "layer_1/w"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "layer_1/add", "op": "Add", "input": ["layer_1/MatMul", "layer_1/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_1/Relu", "op": "Relu", "input": ["layer_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer_1/Shape", "op": "Shape", "input": ["layer_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dropout_layer_1/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout_layer_1/Shape"], "attr": {"seed": {"i": "404"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}, "seed2": {"i": "26"}}}, {"name": "dropout_layer_1/GreaterEqual", "op": "GreaterEqual", "input": ["dropout_layer_1/random_uniform/RandomUniform", "dropout_layer_1/rate"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer_1/Cast", "op": "Cast", "input": ["dropout_layer_1/GreaterEqual"], "attr": {"SrcT": {"type": "DT_BOOL"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer_1/mul", "op": "Mul", "input": ["dropout_layer_1/Cast", "dropout_layer_1/truediv"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout_layer_1/mul_1", "op": "Mul", "input": ["dropout_layer_1/mul", "layer_1/Relu"], "attr": {"_grappler:ArithmeticOptimizer:MinimizeBroadcasts": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "layer_2/MatMul", "op": "MatMul", "input": ["dropout_layer_1/mul_1", "layer_2/w"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "layer_2/add", "op": "Add", "input": ["layer_2/MatMul", "layer_2/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "layer_2/Relu", "op": "Relu", "input": ["layer_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output/MatMul", "op": "MatMul", "input": ["layer_2/Relu", "output/w"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "output/add", "op": "Add", "input": ["output/MatMul", "output/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output/Relu", "op": "Relu", "input": ["output/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction", "op": "ArgMax", "input": ["output/Relu", "accuracy_calc/prediction/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}], "library": {}, "versions": {"producer": 38}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "accuracy_calc/prediction/dimension", "shape": [], "dtype": "int32"}, {"name": "output/b", "shape": [10], "dtype": "float32"}, {"name": "output/w", "shape": [64, 10], "dtype": "float32"}, {"name": "layer_2/b", "shape": [64], "dtype": "float32"}, {"name": "layer_2/w", "shape": [512, 64], "dtype": "float32"}, {"name": "layer_1/b", "shape": [512], "dtype": "float32"}, {"name": "layer_1/w", "shape": [784, 512], "dtype": "float32"}, {"name": "dropout_layer_1/truediv", "shape": [], "dtype": "float32"}, {"name": "dropout_layer_1/rate", "shape": [], "dtype": "float32"}]}]}